import scipy


# 1) Провести дисперсионный анализ для определения того, есть ли различия среднего роста среди взрослых футболистов,
# хоккеистов и штангистов.
# Даны значения роста в трех группах случайно выбранных спортсменов:
# Футболисты: 173, 175, 180, 178, 177, 185, 183, 182.
# Хоккеисты: 177, 179, 180, 188, 177, 172, 171, 184, 180.
# Штангисты: 172, 173, 169, 177, 166, 180, 178, 177, 172, 166, 170.
football = [173, 175, 180, 178, 177, 185, 183, 182]
hockey = [177, 179, 180, 188, 177, 172, 171, 184, 180]
lifter = [172, 173, 169, 177, 166, 180, 178, 177, 172, 166, 170]
sports = [football, hockey, lifter]
for item in sports:
    print(scipy.stats.shapiro(item))

print(scipy.stats.bartlett(football, hockey, lifter))
print(scipy.stats.f_oneway(football, hockey, lifter))
# F_onewayResult(statistic=5.500053450812596, pvalue=0.010482206918698694)
# вывод : с достоверностью 95% различия среднего роста в группах есть.

print(scipy.stats.tukey_hsd(football, hockey, lifter))

# Tukey's HSD Pairwise Group Comparisons (95.0% Confidence Interval)
# Comparison  Statistic  p-value  Lower CI  Upper CI
#  (0 - 1)      0.458     0.979    -5.357     6.273
#  (0 - 2)      6.398     0.022     0.837    11.958
#  (1 - 0)     -0.458     0.979    -6.273     5.357
#  (1 - 2)      5.939     0.028     0.561    11.318
#  (2 - 0)     -6.398     0.022   -11.958    -0.837
#  (2 - 1)     -5.939     0.028   -11.318    -0.561
# Вывод : с достоверностью 95 % - различия среднего роста есть в группе штангистов, для хоккеистов и футболистов нет.