import numpy as np
import scipy.stats as stats

# 1 )  Даны две  независимые выборки. Не соблюдается условие нормальности
# x1  380,420, 290
# y1 140,360,200,900
# Сделайте вывод по результатам, полученным с помощью функции
# Вывод: с достоверностью  95 % различий между выборками нет
x1 = np.array([380, 420, 290])
y1 = np.array([140, 360, 200, 900])
print(stats.mannwhitneyu(x1, y1))

# Сделайте вывод по результатам, полученным с помощью функции
# 2 ) Исследовалось влияние препарата на уровень давления пациентов. Сначала измерялось давление до приема препарата,
# потом через 10 минут и через 30 минут. Есть ли статистически значимые различия?
# 1е измерение до приема препарата: 150, 160, 165, 145, 155
# 2е измерение через 10 минут: 140, 155, 150,  130, 135
# 3е измерение через 30 минут: 130, 130, 120, 130, 125
# Вывод: с достоверностью  95 % препарат снижает давление.
before = np.array([150, 160, 165, 145, 155])
minutes_10 = np.array([140, 155, 150,  130, 135])
minutes_30 = np.array([130, 130, 120, 130, 125])
print(stats.friedmanchisquare(before, minutes_10, minutes_30))

# 3 ) Сравните 1 и 2 е измерения, предполагая, что 3го измерения через 30 минут не было.
# Вывод: с достоверностью  95 % статистической разницы в наблюдениях нет.
print(stats.wilcoxon(before, minutes_10))

# 4) Даны 3 группы  учеников плавания.
# В 1 группе время на дистанцию 50 м составляют:
# 56, 60, 62, 55, 71, 67, 59, 58, 64, 67
# Вторая группа : 57, 58, 69, 48, 72, 70, 68, 71, 50, 53
# Третья группа: 57, 67, 49, 48, 47, 55, 66, 51, 54
# Вывод: с достоверностью  95 % статистической разницы между группами нет.
group_1 = np.array([56, 60, 62, 55, 71, 67, 59, 58, 64, 67])
group_2 = np.array([57, 58, 69, 48, 72, 70, 68, 71, 50, 53])
group_3 = np.array([57, 67, 49, 48, 47, 55, 66, 51, 54])
print(stats.kruskal(group_1, group_2, group_3))

# 5) Заявляется, что партия изготавливается со средним арифметическим 2,5 см.
# Проверить данную гипотезу, если известно, что размеры изделий подчинены нормальному закону распределения.
# Объем выборки 10, уровень статистической значимости 5%
# 2.51, 2.35, 2.74, 2.56, 2.40, 2.36, 2.65, 2.7, 2.67, 2.34
# Гипотеза верна
smth = np.array([2.51, 2.35, 2.74, 2.56, 2.40, 2.36, 2.65, 2.7, 2.67, 2.34])
var_mean = np.mean(smth)
square = [(x - var_mean) ** 2 for x in smth]
var_disp = np.mean(square)
st_div = (var_disp * len(smth)/(len(smth) - 1)) ** 0.5
z = (np.mean(smth) - 2.5) * len(smth) ** 0.5 / st_div
print(-stats.t.ppf(0.975, 9) < z < stats.t.ppf(0.975, 9))


