# Напишите программу, которая определит позицию второго вхождения строки в списке
# либо сообщит, что её нет.
# *Пример:* - список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe",
# ответ: 3 - список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"],
# ищем: "йцу", ответ: 5 - список: ["йцу", "фыв", "ячс", "цук", "йцукен"],
# ищем: "йцу", ответ: -1 - список: ["123", "234", 123, "567"],
# ищем: "123", ответ: -1 - список: [], ищем: "123", ответ: -1


list_example = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
substring ='qwe'

if list_example.count(substring) > 1:
    list_example.remove(substring)
    print(list_example.index(substring) + 1)
else:
    print(-1)
