# 3. Напишите программу, в которой пользователь будет задавать две
# строки, а программа - определять количество вхождений одной строки в другой.
#
# *Пример:*
# 'Я люблю Питон!'
# 'лю'
string_1 = input('Введите первую строку: ')
string_2 = input('Введите вторую строку: ')
print(string_1.count(string_2))